---
kind: method
id: M:Autodesk.Revit.DB.FamilyParameterSet.ForwardIterator
source: html/048f14e4-2760-8c6d-fdbe-98f6ed97ccb7.htm
---
# Autodesk.Revit.DB.FamilyParameterSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual FamilyParameterSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.